ArtMoney Plugin
8.17//Sürüm
Türkçeye çeviren:
Seferi
seferi@gmail.com
Hakkında
Oyun Hilecisi
<d> <ms> <yyyy>//tarih biçimi
Tescil Hakkı (C) 1996-2020, System SoftLab
Herhangi bir hata bulursanız veya
önerileriniz varsa, e-posta gönderin:
Son sürüm için lütfen ArtMoney sitesini ziyaret edin
Değer
Ara
Filtrele
Değer sayısı
Öncelikle oyun işlemini seçin
Şimdi işlem içinde arayın
Eşleşen olay sayısı artık azalmayana kadar filtreleyin
Üzgünüm, hiçbir şey bulunamadı. Tekrar deneyin.
Devre dışı bırak
Bulunan
adres
adres
adres
Tabloda
Yükleme hatası
Arama hatası
Filtreleme hatası
Dosya biçimi desteklenmiyor
Seçtiğiniz tür için imkansız sayı
Yükleyemiyorum
Arama işlemi
Filtreleme işlemi
hepsi mümkün
bayt
bayt
bayt
Geçersiz yöntem. Diğerlerini deneyin.
sn
dk
Bu yöntem için herhangi bir tür seçmediniz.
Türün boyutu şundan büyük olamaz:
değişti
değişmedi
arttı
azaldı
Bu tablo daha yeni bir sürümle yapılmıştır
Bu tablo hasarlı
Dosya erişim hatası
Tamsayı 1 bayt
Tamsayı 2 bayt
Tamsayı 3 bayt
Tamsayı 4 bayt
Tamsayı 8 bayt
Kesirli 4 bayt
Kesirli 6 bayt
Kesirli 8 bayt
Kesirli 10 bayt
Metin
Boş değerle sonlandırılmış dizgi
Boş dizgi
Pascal dizgisi
Ters Tamsayı 2 bayt//R.=Reverse
Ters Tamsayı 3 bayt
Ters Tamsayı 4 bayt
Ters Tamsayı 8 bayt
Ters Kesirli 4 bayt
Ters Kesirli 6 bayt
Ters Kesirli 8 bayt
Ters Kesirli 10 bayt
Ters Metin
Ters Boş dizgi
Ters Pascal dizgisi
Ocak
Şubat
Mart
Nisan
Mayıs
Haziran
Temmuz
Ağustos
Eylül
Ekim
Kasım
Aralık
Dondur//F=Freeze
Yardım
Hakkında
İşlem seçin
Temizle
Yükle
Kaydet
Ekle
Hepsini ekle
Düzenle
Kopyala
Sil
Dondur
Dondurmayı iptal et
Sapmayı otomatik uygula
Bilgi
İşlem türü
Dondurma süresi (ms)
Yenileme süresi (ms)
Arayüz dili
Adresleri göster
Ekrana çağırma kısayolu
Genel
Ekstra
Kişisel
E-posta
Varsayılan yorum
İşletim Sistemi
Ondalık biçim
Baytların sıralaması
Tarama önceliği
Yüksek
Tam
Seçenekler
İptal
Normal
Adresi düzenle
Dondur
Boyut
Adres
Açıklama
Tür
Ters
Kesin değer
Değerlerin sıralaması
Değerlerin aralığı
Bilinmeyen değer
Kodlanmış değer
Özel ayarlar
Tür seç
Baytların sıralaması
Normal ve tersine
HEPSİ
Tamsayı
Kesirli
Geçen Zaman:
Kalan Zaman:
Hız:
Bulunan:
Oyun
Yorum
Tarih
Sistem
Tablo bilgisi
Oluşturan:
İsim
Konum
Sıralama girişi
Kısayol tuşu oluştur
Ters
Bu bellek bloğunda ara
Adres aralığında ara
Disk alanını arttır
şu değerden:
şu değere:
Ara
Filtrele
Adım
Adım//Değer belirle
Değer belirle
Hepsini seç
OTOMATİK
İşlemi göster
Görünür
Pencere ile
İşlem bilgisi
İşlemi sonlandır
Pencereyi göster
Pencereyi gizle
İşlemi sonlandırmak istediğinize emin misiniz?
Erişim engellendi
İşlem sonlandırılamıyor
Dosya ismi
İşlem türü
Veri boyutu
Karşılaştır
Bellek tarama hızını ölçmek için karşılaştır
Bekle
Sisteminiz
Özel kısayol tuşları
Değere ekle
Bu pencereyi kilitle
Filtrelemeyi "Geri al/Yinele" etkin
Tamsayı görünümü
İşaretsiz
İşaretli
Filtrelemeyi geri al
Filtrelemeyi yinele
Filtrelemeyi kaydet
Filtrelemeyi yükle
Şu andaki adım:
"Filtrelemeyi geri al" etkin değil
"Filtrelemeyi yinele" etkin değil
"Filtrelemeyi yükle" etkin değil
şu kadar arttı:
şu kadar azaldı:
Arayüz
Kısayollar
Kısayollar etkin
Varsayılan kısayollar
Ana yazı tipi
Tablo yazı tipi
Ana renk
Rengi düzenle
Düğme rengi
Oval düğme
TAMAM
Bellek düzenleyici
Onaltılık görünüm
Onaltılık düzenleme
Değer sütunlarının sayısı
Hücre görünümü
Şu andaki hücre
Taşıma
Arama sonuçlarına taşıma
Tabloya taşıma
Bellek bloğuna taşıma
Adrese taşıma
İlk
Önceki
Sonraki
Sonuncu
Toplam
Şu andaki
Alanı kopyala
Alana ekle
Tabloya ekle
Hepsi (standart)
Tamsayı (standart)
Kesirli (standart)
Seçimi evir
Sütunları hizala
<HAYIR>
İşaretçi
Yenile
Seçileni düzenle
Grup
Görünür grup
Grup seç
Bu adresi/işaretçiyi kaydet
Sapmayı hepsine otomatik uygula
Sapmayı gruba otomatik uygula
Kayıtlı adres sapmasını hepsine otomatik uygula
Kayıtlı adres sapmasını gruba otomatik uygula
İşaretçi komutları
İşaretçiyi hepsine ayarla
İşaretçiyi gruba ayarla
Kayıtlı işaretçiyi hepsine ayarla
Kayıtlı işaretçiyi gruba ayarla
İşaretçiyi bu adrese ayarla
İşaretçiyi kayıtlı adrese ayarla
İşaretçiyi bu adrese doğru ara
İşaretçiyi bellek bloğu başlangıcına doğru ara
Sıralama
Açıklamaya göre sırala
Adrese göre sırala
Değere göre sırala
Değere göre metin olarak sırala
Gruba göre sırala
Birleştirme
Birleşme hatası
Her iki tablo da aynı kişi tarafından oluşturulmalı
Şu andaki işlemi seç
Karakter seti
Görünür grup panosunu göster
grupta
İşaretçileri adreslere dönüştür
Filtre ayarla
Dizgi
<Dosya bulunamadı>
<Erişim engellendi>
Dosya Düzenleyici
Hatalar
<Boyut değişti>
Kaplama
Kaplama yok
Yazı tipini düzenle
Tablo rengi
Bellek dökümünü kaydet
Formül ile
İşlem
İşlemi durdur
İşleme devam et
İşlemi kaydet
İşlemi yükle
İşlem ID
İş parçacıkları
Dosya(lar)
Dosya(lar) Bilgisi
Dosya seç
Klasör seç
Dosya(lar) sayısı
Toplam boyut
Klasöre taşıma
Nesne
Tablo
Çıkış
Sonuç
Daha fazla
"ArtMoney Pro"yu çevrimiçi satın al
Anasayfayı ziyaret et
ArtMoney Kullanım kılavuzu
Kodlama
Kodlama seç
Parlaklık
Renk tonu
Ana menüyü göster
Resmi olmayan dil eklentilerini kullan
Arama esnasında işlemi durdur
Dosya tablosundaki değerleri Kaydet/Yükle
İşlem görüntüleyici kütüphanesi
Klasör seçenekleri
Dosya adı maskesi
Modifiye zamanı
Dosya Tarihi
Dosya Zamanı
Kontrol etme
Son 15 dakika
Son saat
Son gün
Geçen ay
Geçen yıl
Daha fazla
Daha az
Bu özellik yalnızca ArtMoney Pro Edition'da mevcuttur
Yalnızca ArtMoney Pro'da
Lisans Sözleşmesi
Lisans Sözleşmesinin hüküm ve koşullarını kabul ediyorum
PRO Edition hakkında
Özel teşekkürler
kullanım kılavuzunun dizaynı için
logo için
kurulum modülü için
simge yapımı için
İngilizce kullanım kılavuzunun dilbilgisi denetimi için
yardımları için
kaplama motoru (ThemeEngine paketi) için
öneri ve değerli görüşleri için
çeviri için
tablolar için
Kayıt Numarası
Kayıtlı değil
Şifremi tekrar sorma
Yalnızca şu andaki Windows kullanıcısı için
İşlemi durdur ve ekrana getir
İşleme geç ve devam ettir
Gereksiz kapanış parantezi
Eksik kapanış parantezi
Gereksiz kapanış tırnak işareti
Geçersiz ID
Geçersiz değişken sayısı (M1,M2...)
Geçersiz işlem sayısı (-,+)
Geçersiz koşul sayısı (<,>,=)
Geçersiz ifade sayısı
Geçersiz ifade
Bu adım mevcut değil
Geçersiz koşul
Geçersiz parametre
Koşul yok
Arama
Kayıt
Şifre
Lütfen şifreyi girin ve "OK" tuşuna basın
Yanlış şifre
Yanlış veya eski anahtar dosyası
Anahtar dosyası yok
Varsayılan
Kullanıcı tarafından iptal edildi
Kullanım kılavuzu dili
İşlem bulunamadı veya erişim engellendi
Tablodaki değerleri yalnızca yapı odaklı olarak yenile
Kod boyutu
İşlem haritası
Bölge adresi
Eyalet
Bölge koruması
Koruma
Modül adı
Bu özellik yalnızca Windows 2000/XP/2003/VISTA/2008/7/8/2012/10'da çalışır
İşlem kaydetme/yükleme
Mod
Geçersiz İşlem. İşlem değiştirildi veya yeniden başlatıldı.
Kapat
Excelde
Kesirli değerleri yuvarla
Macromedia Flash
Alan
İşlemi bellekte sakla
Ayrılmış fiziksel bellek boyutu
Yeni bir işlem çalıştır
Kur
Masaüstünde kısayol oluştur
İşlemi gizle
İşlemi göster
Emülatör
Oyun sistemi
Adres aralığı
Emülatör seçeneklerini kullan
Emülatör bellek haritası
Emülatör adresi
PC adresi
Emülatör adreslerini PC adreslerine dönüştürmek istiyor musunuz?
PC adreslerini emülatör adreslerine dönüştürmek istiyor musunuz?
Adres dönüştürme hatası
Emülatörü dosya adına göre otomatik algıla
Gruplar
Grup ağacını göster
Hiçbiri
Sol
Sağ
Yeni Grup
Temel
Dil
Bu dili silmek istiyor musunuz?
Yeni bir dil eklemek istiyor musunuz?
Dilin adını değiştirmek istiyor musunuz?
normal dondurma
artabilir
azalabilir
en azdan en çoğa
En az
En çok
Seçileni kopyala
"Spyware Process Detector" programını indir
"Spyware Process Detector" programı bilgisayarınızda bulunamadı. Programı şirketimizin sitesinden indirerek yükleyebilirsiniz: www.systemsoftlab.com. Bu program, ArtMoney programı ile birlikte işlem seçici olarak kullanılabilir. "Spyware Process Detector" programını kullanarak, bütün gizli ve açılması engellenen işlemleri açabilirsiniz. Bu program, bilgisayarınızda çalışan işlemler hakkında detaylı bilgiler gösterir ve yeni çıkan (antivirüs programınızın saptayamadığı) casus yazılım, truva atı ve virüsleri tespit eder.
Öneri ve hata raporlarınızı gönderin:
Şirketimizin sitesini ziyaret edin ve diğer programları indirin
Bu ücretsiz KISITLI sürümdür. Tam sürümünü yalnızca 24.90 dolara satın alabilirsiniz.
Yalnızca kayıtlı kullanıcılar tam teknik destek alabilir ve bütün ekstra özellikleri kullanabilir.
Satın almak için, internete bağlı olduğunuzdan emin olun ve aşağıda bulunan Şimdi çevrimiçi kayıt ol düğmesine tıklayın.
Şimdi çevrimiçi kayıt ol
Servis Kurulumu
Windows'un servisi kurmak için kullanıcıyı doğrulaması gerekli.
Takip eden kullanıcı olarak kur
Kullanıcı adı
Etki alanı
Servis Kurulum Hatası 
Oturum açma başarısız
Gizli mod
İşlemimi gizle
Penceremi gizle
Eski servis sürümü kurulu. Yeni bir sürüm kurmak için lütfen bilgisayarınızı yeniden başlatın.
Tablo değişti
Değişiklikleri kaydetmek istiyor musunuz?
Çıkış yaparken üzerinde değişiklik yapılmış tabloyu kaydetmeyi öner
Yapı
Atlandı
Alan
Yapı boyutu şundan büyük olamaz:
Öğe
Yeni Öğe
Tablo yapısını ara
Grup yapısını ara
Seçilen adreslerin yapısını ara
Yukarı Çık
Aşağı İn
"ArtMoney Pro"yu Ücretsz Edin
Rusça kullanım kılavuzunun dilbilgisi kontrolü için
Yuvarlama türü
En yakın değere yuvarla
Aşağı yuvarla
Yukarı yuvarla
Sıfıra doğru yuvarla
Devam et
Ücretsiz Edin
Paket açıcı
Assembly yönergesi
Modül adresini kullan
Modül
Modül içindeki adres
Dönüştürme hatası
Modül adresini çeviremiyorum: İşlem içinde böyle bir modül yok.
Sistem modüllerinin bellek alanını tara
Paylaşılan modüllerin bellek alanını tara
İşlem açma hatası
Bu işlem açılamıyor.
PRO sürümünü kullanmayı deneyin.
Bu tablo için PRO sürümüne ihtiyacınız var
Geçersiz kayıt
Geçersiz adres
Geçersiz değer
Bu değer çok yüksek
Geçersiz assembly yönergesi
Bir defalığına ArtMoney programını yönetici olarak çalıştırın. Bunu yapmak için Artmoney kısayoluna sağ tuşla tıklayın ve içerik menüsünden "Yönetici olarak çalıştır" seçeneğini seçin.
Servis başlama hatası
Servis açılma hatası
Bilgisayarınızı yeniden başlatmayı deneyin
şu tarafından değiştirildi:
Tablo dönüştürme
Tablonuzu 64-bit moduna dönüştürmek istiyor musunuz?
Tablonuzu 32-bit moduna dönüştürmek istiyor musunuz?
Dönüştürme hatası oluştu. Program adresleri 32-bit moduna dönüştüremiyor.
Adres katlılığı//Adres bölünebilirliği
Çift//2'ye bölünebilir
Tek
4'ün katı//4'e bölünebilir
8'in Katı//8'e bölünebilir
16'nın katı//16'ya bölünebilir
Yalnızca modüllerdeki statik adresleri tara
Modül seçeneklerini göster
Kayıt kodunu girin
Lütfen kayıt kodunuzu panodan yapıştırın (Ctrl-V veya "Yapıştır" düğmesini kullanın) ve "OK" düğmesini tıklayın.
Yapıştır
Kayıt kodu geçersiz
Kayıt kodu yalnızca ingilizce sürüm içindir
Kayıt kodu yalnızca rusça sürüm içindir
Kayıt kodu yalnızca eski bir sürüm içindir
Kayıt kodu artık çalışmıyor. Yeni kayıt kodunuzu almak için lütfen sales@systemsoftlab.com adres ile irtibata geçin
Eğer adınızı ve bilgilerinizi burada göremiyorsanız, kırılmış veya çalıntı bir sürüm kullanıyorsunuz, ve bu sürüm düzgün çalışmayabilir!
İşaretçiden İşaretçiye
Maksimum sapma
Şu seviyeden:
İşaretçiden İşaretçiye ara
SE sürümü için en çok 2 seviye!
Sürücü İmzası Zorlamasını Devre Dışı Bırakmayı dene
Hızlı mod (daha çok bellek kullanır)
Mb
Sapmayı otomatik uygula ve yeni gruba kopyala
Bloktaki adres
Bloktaki adresi dönüştüremiyorum: İşlem içinde böyle bir blok yok.
Dönüştürme sorunu: Blok boyutu benzersiz değil.
İşaretçileri sapmaya göre sırala
Tam gizlilik modu için metni gizle//yalnızca VIP
Çevrimiçi Oyun Hesabı Satın Al veya Sat
Yeni sürüm indirilmeye hazır
Yeni sürüm için kontrol et
Sapma işaretçisi
En büyük sapmaya sahip işaretçiyi ara
2 adımdan mevcut
Formül
Sürüm
Her Zaman Üstte
"Her Zaman Üstte" Etkin
"Her Zaman Üstte" Devre Dışı
İnternet bağlantınızı kontrol edin! systemsoftlab.com adresi açılamıyor
Seçeneği ayarlamayı dene
Ad/Modül
Onaltılı Kod
Kayıt
İşaret
Hata Ayıklayıcıyı Ekle
Hata Ayıklayıcıyı Ayır
Hata ayıklayıcıyı seçili işleme eklemek istiyor musunuz?
Ara verme noktası listesi
Komutlar
Hata ayıklama
Hata ayıklama bilgisini kaydet
Hata ayıklama bilgisini yükle
Assembly dili
x86-32 bit
x86-64 bit
Ara verme noktası
Ara verme noktası ekle
Ara verme noktasını kaldır
Çalıştır
-e dek çalıştır
Geri dönene kadar
Adımı izle
Adım atlamayı izle
Adres adını ayarla
Adres adını kaldır
Evet
Hayır
Hata ayıklayıcı türü
Standart
İstisnaları yönetme
Yürütülebilir ara verme noktası türü
Yazılım (int3 yönergesi)
int3
Hata ayıklama kayıtları (en fazla 4)
kayıt
Sayfa istisnaları
istisnalar
Ara verme noktası türüne erişim
Hata ayıklayıcının işleme ne zaman ekleneceğini sor
Bütün hata ayıklama kayıtları kullanılmışsa yazılım ara verme noktalarını kullan
Hata ayıklama bilgisini otomatik Kaydet/Yükle
Hata ayıklama sembollerini kullan
Sembol yolu
Aktif
Dur
Çalıştır
Herhangi bir erişim
Yaz
Koşullar
Değişiklikler
HEPSİ Etkin
HEPSİ Devre Dışı
Adrese erişimi olan bir yönerge bul
Bellek erişimi üzerinde
Bellek yazımı üzerinde
Koşul hatası
Değişiklik hatası
Sıfıra böl
Okuma hatası
Yazma hatası
Yanlış sol taraf
Başlat
Durdur
Erişim
Sonuçları temizle
İş parçacıklarına böl
Sayı
İş parçacığı
8-bit
16-bit
32-bit
Onaltılı
Onaltılı
Float4
Float8
Onaltılı dizi
systemsoflab.com serveri cevap vermiyor veya internet bağlantısı yok
Kayıt kodu banlandı
Bu kodu günde yalnızca 2 defa etkinleştirebilirsiniz
Bu kayıt kodu yalnızca VIP Sürümü içindir
Mevcut hata ayıklayıcıyı gizle
Tabloyu unicode olarak kaydet
İşlev sona erene kadar boyut al (geri dönene kadar)
Lisanslar
Scan memory regions
data writable
data readonly
code writable
code readonly
shared
system
guarded
hidden
Multiplicity of each address
Address names and symbols list
Folder symbols
User names
Case sensitive
Whole words
First position
Read/Write
Auto detect size of functions
Hide debug registers
Patch this functions (structures)
işlem korumayı atla
Belleğe erişim için kendi işlevlerini kullan
User mode functions (attach to the process)
Kernel mode functions (via driver)
Attach to the process without OpenProcess
Signatures
Signature search
Add signature
Offset
Auto search
Static adress
Regions
Edit as the assembly code
As assembly code
Convert to HEX
Limit unique offsets per level
Code replacing
Replace the code
Replace all codes simultaneously
<REPLACED>
<NOT REPLACED>
<NO MODULE>
<NO BLOCK>
<NO SIGNATURE>
<NO VARIABLE>
Code injecting
Inject the code
Only after successed code replacing
Automatically replace all codes and inject
Allow to automatically replace all codes and inject
Ask for permission to automatically replace all codes and inject
The table contains a code for injection and replacement. It can be malicious code! Download tables only from most trusted websites! Do you want to inject the code in the process?
Replace all codes and inject
Cancel code replacing and injecting
Signature
Original Signature
Wrong original signature
Address of signature//full
Address of sign.//short
Address of variable/label//full
Address of variable//short
I can not convert the address of signature: No such signature.
I can not convert the address of variable: No such variable.
Name//variable or label
Code size for replacing 
One assembler instruction
Several assembler instructions
Line
Relative addressing error (offset is too big)
Invalid multiplier
Back jmp error
Cannot allocate memory
Areas//Memory areas
Set mirror address
Clear mirror address
from the minimum address
Service
Show pointer offsets in hexadecimal
Use RAX(EAX) register. Only MOV instruction with RAX(EAX) register can read/write an absolute address!
Change process speed
Your speed (%)
Normal//Speedd
Change process speed error
Increase process speed
Decrease process speed
Stack
View as stack
Save thread stack
Return adress
Parameter
Parameters
Show parameters in one line
Return address only in module
Read Memory Error
Digits after a decimal point (Fractional part)//full
Digits a.//short
Masks
Read mask
Write mask
Use mask type
<MASK ERROR>
Server sent an invalid response or bad internet connection
stacks
Use stack of the threads as module name
Limit the number of threads
Stack of thread
64-bit stack of thread
Temp files folder
Current user folder
Program folder
Another folder
Temp folder error
Temp folder does not exist and could not be created
Last digits
D5ABBFC8